{
    "roles": {
        "Admin": {
            "priority": 1,
            "modifiable": "False"
        },
        "User": {
            "priority": 2,
            "modifiable": "False"
        }
    },
    "list": {
        "languages": {
            "items": ["de", "en", "fr"]
        }
    },
    "feature_restrictions": {
        "process_action_read_document": {
            "restriction": 2  
        }
    },
    "content": {
        "how_to_cite": {
            "text": "@inproceedings{Leonhardt:et:al:2023,\n\ttitle = {Unlocking the Heterogeneous Landscape of Big Data {NLP} with {DUUI}},\n\tauthor = {Leonhardt, Alexander and Abrami, Giuseppe and Baumartz, Daniel and Mehler, Alexander},\n\teditor = {Bouamor, Houda and Pino, Juan and Bali, Kalika},\n\tbooktitle = {Findings of the Association for Computational Linguistics: EMNLP 2023},\n\tyear = {2023},\n\taddress = {Singapore},\n\tpublisher = {Association for Computational Linguistics},\n\turl = {https://aclanthology.org/2023.findings-emnlp.29},\n\tpages = {385--399},\n\tpdf = {https://aclanthology.org/2023.findings-emnlp.29.pdf},\n\tabstract = {Automatic analysis of large corpora is a complex task, especially\nin terms of time efficiency. This complexity is increased by the\nfact that flexible, extensible text analysis requires the continuous\nintegration of ever new tools. Since there are no adequate frameworks\nfor these purposes in the field of NLP, and especially in the\ncontext of UIMA, that are not outdated or unusable for security\nreasons, we present a new approach to address the latter task:\nDocker Unified UIMA Interface (DUUI), a scalable, flexible, lightweight,\nand feature-rich framework for automatic distributed analysis\nof text corpora that leverages Big Data experience and virtualization\nwith Docker. We evaluate DUUI{'}s communication approach against\na state-of-the-art approach and demonstrate its outstanding behavior\nin terms of time efficiency, enabling the analysis of big text\ndata.}\n}"
        },
        "ttlab_github": {
            "link": "https://github.com/texttechnologylab"
        }
    }
}